[{"link":"https://remoteok.io//remote-jobs/68102-remote-junior-software-engineer-formstack","company":"Formstack","title":"Junior Software Engineer","tags":["dev","junior","engineer","digital nomad"],"time":"23h","description":"Formstack, the most flexible and powerful form building application, now has many products! We are looking for a Junior Software Engineer to add to the  document creation team!Formstack is a 12-year-old company with its roots in Indianapolis. Our customers span 110 different countries, and our employees live and work across the U.S. and the globe. We provide a work environment that is flexible and provides great freedom for those who can perform. We are seeking people who demonstrate an ability to work effectively with individuals from diverse cultures and backgrounds.Who You Are:We're looking for someone who wants to take part into building great customer experience, and learn their craft as a PHP developer with help of others on the team and company. We believe in learning through practice, but also support you with paid learning time, in-house lunch & learn sessions, as well as access to conferences and events. Experience with PHP Frameworks and unit tests is a plus, but is not required.What You Will Do:* Maintain and evolve application that gathers and processes user data, producing documents in various formats and delivering them to 3rd party systems* You'll spend your day working with more experienced colleagues on implementing new features, agreed on with cooperation with product manager and designers, as well as solving issues reported by our customers.* We'll expect you to create a code following best practices, test it and release it into production.* We work in a Scrum environment, delivering increments of functionality and iterating over them.What We Are Looking For:* Understanding of basic OOP principles and knowledge of PHP language* Basic understanding of MySQL or other relational database* Basic understanding of Git or other version control system* Ability to work remote and with remote team members* Excellent oral and written English communication skills* Ability and passion to learn from experienced team members - Passion for software development* Exceptional customer service skills* The Ability to travel (<10%) for team meetups, conferences, etc.Bonus Points* Experience with PHP Frameworks (Laravel, Symfony, Zend, CakePHP, YII)* Understanding of RESTful web services* Javascript* CSS* Unit testingWhat Formstack Offers:* 100% covered Medical Insurance, as well as company-paid Dental, Vision, Disability and Life Insurance Benefits for full-time employees.* Unlimited PTO for all employees* 401k with matching company contribution for full-time employees* The most up-to-date technology, including company-issued Macs, the latest software and other tools needed to excel at your job* Company-paid conferences and extended learning* Yearly company gatheringsWant to learn more about who we are and what we value? Check out this video and apply if you want to jump into the next great chapter of your life.Formstack is proud to be an equal opportunity workplace dedicated to pursuing and hiring a diverse workforce.All data collected in our application process from resume collection to application questions is used for recruitment purposes only. We will store it in our applicant tracking system, JazzHR, and will not share this data with anyone else. We will keep your data until the role is filled and only continue to store it if we feel you may fit future roles.Thank you for your interest in Formstack!See more jobs at Formstack"}]